//Напишите функцию printPrimeNums, которая выведет на экран все простые числа в промежутке от 1 до 1000,
// каждое на новой строке.
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}